30/feature.SOAP_POST.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:feature\/SOAP_POST.feature","packageQualifiedName":"feature.SOAP_POST","loopIndex":-1,"relativePath":"feature\/SOAP_POST.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":467008,"millis":0.467008,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":369806,"millis":0.369806,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":865615,"millis":0.865615,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":544709,"millis":0.544709,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":255896198,"millis":255.896198,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":304005,"millis":0.304005,"status":"passed"},"step":{"line":11,"prefix":"Given","index":0,"text":"request body"}},{"result":{"nanos":580667799,"millis":580.667799,"status":"passed"},"step":{"line":12,"prefix":"When","index":1,"text":"soap action 'NumberToWords'"},"stepLog":"23:37:51.071 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>500<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:37:51.236 response time in milliseconds: 165\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:37:51 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>five hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":5200,"millis":0.0052,"status":"passed"},"step":{"line":13,"prefix":"Then","index":2,"text":"status 200"}},{"result":{"nanos":1938662,"millis":1.938662,"status":"passed"},"step":{"line":14,"prefix":"And","index":3,"text":"print response"},"stepLog":"23:37:51.240 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>five hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1204239,"millis":1.204239,"status":"passed"},"step":{"line":15,"prefix":"And","index":4,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'five hundred'"}}],"executorName":"pool-1-thread-1","line":10,"name":"Sample POST","description":"","durationMillis":842.263241,"startTime":1691797070385,"failed":false,"refId":"[1:10]","endTime":1691797071241,"exampleIndex":-1},{"sectionIndex":1,"stepResults":[{"result":{"nanos":474108,"millis":0.474108,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":16596279,"millis":16.596279,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":903115,"millis":0.903115,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":572210,"millis":0.57221,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":266623978,"millis":266.623978,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":377269336,"millis":377.269336,"status":"passed"},"step":{"line":18,"prefix":"*","index":0,"text":"set body\/Envelope\/Body\/NumberToWords\/ubiNum = 300"}},{"result":{"nanos":212804,"millis":0.212804,"status":"passed"},"step":{"line":19,"prefix":"Given","index":1,"text":"request body"}},{"result":{"nanos":192644351,"millis":192.644351,"status":"passed"},"step":{"line":20,"prefix":"When","index":2,"text":"soap action 'NumberToWords'"},"stepLog":"23:37:51.064 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>300<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:37:51.227 response time in milliseconds: 163\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:37:50 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>three hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":6800,"millis":0.0068,"status":"passed"},"step":{"line":21,"prefix":"Then","index":3,"text":"status 200"}},{"result":{"nanos":2936794,"millis":2.936794,"status":"passed"},"step":{"line":22,"prefix":"And","index":4,"text":"print response"},"stepLog":"23:37:51.232 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>three hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1697254,"millis":1.697254,"status":"passed"},"step":{"line":23,"prefix":"And","index":5,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'three hundred'"}}],"executorName":"pool-1-thread-2","line":17,"name":"Sample POST after updating xml file content","description":"","durationMillis":859.937029,"startTime":1691797070373,"failed":false,"refId":"[2:17]","endTime":1691797071234,"exampleIndex":-1}],"callDepth":0,"name":"SOAP Sample POST","description":"","resultDate":"2023-08-11 11:37:52 PM","durationMillis":1702.20027,"passedCount":2}